app/controllers/canvas_controller.rb

  def create
    @auth = Facebook.auth.from_signed_request(params[:signed_request])
    if !@auth.authorized?
      render :authorize
      return
    end
    authenticate Facebook.identify(@auth.user)
    account= Facebook.identify(@auth.user)
    scenario=account.scenario
    if (scenario.nil?)
      #Create the scenario
      scenario=Scenario.new(:facebook => account, :name=>'Your Scenario')
      scenario.save
---
INSERT INTO "facebooks" ("identifier", "access_token", "created_at", "updated_at") VALUES ('680910732', 'AAACu1psZB9k0BAJpx2g4hIIWxIoCIN4CIzEw1zU8ZCYP1tm3fCfZA66opNI9PCZCPeZBK5iuX5laRi94VZAhGxuco0Onka0nZBceoXWgVR8bQZDZD', '2012-09-22 03:39:19.064286', '2012-09-22 03:39:19.064286')